Repository: idoosmart/Native_Demo
Catalog: example_ios/IDODemo-Cocoapods/IDODemo/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Activity Time
zh_hans: 活动时间

source: Aerobic Training Effect
zh_hans: 有氧训练效果

source: aerobics
zh_hans: 有氧运动

source: alpine skiing
zh_hans: 高山滑雪

source: Anaerobic Training Efect
zh_hans: 无氧训练效果

source: archery
zh_hans: 射箭

source: Average Cadence
zh_hans: 平均步频

source: Average Effort Pace
zh_hans: 平均实时配速

source: Average Heart Rate
zh_hans: 平均心率

source: Average Pace
zh_hans: 平均配速

source: Average Power
zh_hans: 平均功率

source: Average Speed
zh_hans: 平均速度

source: Average Stride Length
zh_hans: 平均步幅

source: Average Vertical Speed
zh_hans: 平均垂直速度

source: badminton
zh_hans: 羽毛球

source: ballet
zh_hans: 芭蕾

source: barbell
zh_hans: 杠铃

source: baseball
zh_hans: 棒球

source: basketball
zh_hans: 篮球

source: Battery Level
zh_hans: 电池电量

source: Battery Life Based On Soc
zh_hans: 基于电量的剩余续航时间

source: beach soccer
zh_hans: 沙滩足球

source: biathlon
zh_hans: 冬季两项

source: billiards
zh_hans: 台球

# ble_off
source: Bluetooth is off
zh_hans: 蓝牙已关闭

source: bowling
zh_hans: 保龄球

source: boxing
zh_hans: 拳击

source: bungee jumping
zh_hans: 蹦极

source: cadence
zh_hans: 步频类

source: Cadence
zh_hans: 步频

source: calisthenics
zh_hans: 健身操

# call_remind
source: Incoming call reminder
zh_hans: 来电提醒

source: Calorie
zh_hans: 卡路里

source: Cancel
zh_hans: 取消

source: climbing machine
zh_hans: 登山机

source: core training
zh_hans: 核心训练

source: cricket
zh_hans: 板球运动

source: Cross country running
zh_hans: 越野跑

source: cross training
zh_hans: 交叉训练

source: cross-country skiing
zh_hans: 越野滑雪

source: curling
zh_hans: 冰壶

source: Current Lap Distance
zh_hans: 当前圈距离

source: Current Time
zh_hans: 当前时间

source: dancing
zh_hans: 跳舞

source: darts
zh_hans: 飞镖

source: distance
zh_hans: 距离类

source: dodgeball
zh_hans: 躲避球

source: dragon boat
zh_hans: 龙舟

source: dumbbells
zh_hans: 哑铃

source: Effort Pace
zh_hans: 实时配速

source: elevation
zh_hans: 海拔类

source: Elevation
zh_hans: 海拔

source: elliptical machine
zh_hans: 椭圆机

# epo_start
source: Start Epo Upgrade
zh_hans: 开始更新epo/agps

# epo_stop
source: Stop Epo Upgrade
zh_hans: 结束更新

# exit_app
source: The app is exiting, do you want to continue?
zh_hans: app正在退出，是否继续?

source: Factory reset
zh_hans: 恢复出厂设置

# fastconfig_fail
source: Fast config failed, need to reconnect
zh_hans: 快速配置失败，需要重新连接

source: fencing
zh_hans: 击剑

# fetch_fail
source: fetch failed
zh_hans: 获取失败

# findDeviceStart
source: Control find device start
zh_hans: 控制寻找设备开始

# findDeviceStop
source: Control find device stop
zh_hans: 控制寻找设备结束

source: fishing
zh_hans: 钓鱼

source: fitness
zh_hans: 健身

source: football
zh_hans: 足球

source: free training
zh_hans: 自由训练

source: frisbee
zh_hans: 飞盘

source: functional strength training
zh_hans: 功能性力量训练

# getActivitySwitch
source: Get event number for activity switch
zh_hans: 获取活动开关

# getAlarm
source: App gets the alarm of ble
zh_hans: app获取ble的闹钟

# getAlgFileInfo
source: Get firmware algorithm file information (ACC/GPS)
zh_hans: 获取固件算法文件信息（ACC/GPS）

# getAllHealthSwitchState
source: Get event number for all health monitoring switches
zh_hans: 获取所有健康监测开关

# getAppletControl
source: Operation of applet information (obtain, start, delete)
zh_hans: 操作小程序信息（获取、启动、删除）

# getBatteryInfo
source: Get battery information event number
zh_hans: 获取电池信息

source: Get Battery Reminder Switch
zh_hans: 获取电量提醒开关

source: Get Bike Lock List
zh_hans: 获取单车锁列表

# getBleBeep
source: Getting firmware local beep file information for V3
zh_hans: 获取固件本地蜂鸣文件信息

# getBleMusicInfo
source: Get Firmware Song Names and Folders
zh_hans: 获取固件歌曲名称和文件夹

# getBpAlgVersion
source: Get blood pressure algorithm version information event number
zh_hans: 获取血压算法版本信息

# getBtConnectPhoneModel
source: Get BT connected phone model
zh_hans: 获取BT连接手机型号

# getBtName
source: Get bt bluetooth name
zh_hans: 获取蓝牙名称

# getBtNotice
source: Query BT pairing switch, connection, A2DP connection, HFP connection status (Only Supported on devices with BT Bluetooth) event number
zh_hans: 查询BT配对开关、连接、A2DP连接、HFP连接状态（仅支持带有BT蓝牙的设备）

# getContactReviseTime
source: Get firmware local contact file modification time event number
zh_hans: 获取固件本地联系人文件修改时间

# getDeviceInfo
source: Get device information
zh_hans: 获取设备信息

# getDeviceLogState
source: Get device log state event number
zh_hans: 获取设备的日志状态

source: Get Device Name
zh_hans: 获取设备名称

# getDownloadLanguage
source: Get Download Language Support
zh_hans: 获取下载语言支持

source: Get error record
zh_hans: 获取错误记录

source: Get Find Phone Switch
zh_hans: 获取寻找手机开关

# getFlashBinInfo
source: Get Font Library Information event number
zh_hans: 获取字库信息

# getFunctionTable
source: Get function table information
zh_hans: 获取功能表

# getGpsInfo
source: Get GPS Information event number
zh_hans: 获取GPS信息

# getGpsStatus
source: Get GPS Status event number
zh_hans: 获取GPS状态

# getHabitInfo
source: Get User Habit Information
zh_hans: 获取用户习惯信息

# getHeartMode
source: Get heart rate mode
zh_hans: 获取心率模式

# getHidInfo
source: Get HID Information
zh_hans: 获取HID信息

# getHotStartParam
source: Get Hot Start Parameters
zh_hans: 获取热启动参数

# getLanguageLibrary
source: Get Language Library List
zh_hans: 获取语言库列表

# getMainSportGoal
source: Get Set Calorie/Distance/Mid-High Sport Time Goal event number
zh_hans: 获取设置卡路里/距离/中高强度运动时间目标

# getMenuList
source: Get Supported Menu List
zh_hans: 获取设备支持的列表

source: Get Menu List V3
zh_hans: 获取菜单列表V3

# getMtuInfo
source: Get MTU Information event number
zh_hans: 获取MTU信息

# getNotDisturbStatus
source: Get Do Not Disturb mode status event number
zh_hans: 获取勿扰模式状态

# getNoticeStatus
source: Get notification center status event number
zh_hans: 获取通知中心开关

# getPetInfo
source: Get Pet Information
zh_hans: 获取宠物信息

source: Get schedule reminder
zh_hans: 获取日程提醒

# getScreenBrightness
source: Get screen brightness event number
zh_hans: 获取屏幕亮度

source: Get Smart Heart Rate Mode
zh_hans: 获取智能心率模式

# getSn
source: Get Device SN
zh_hans: 获取设备序列号

source: Get SpO2 Switch
zh_hans: 获取血氧开关

# getSportsTypeV3
source: Get sports list
zh_hans: 获取运动列表

# getStepGoal
source: Get daily step goal event number
zh_hans: 获取每日步数目标

source: Get Stress Switch
zh_hans: 获取压力开关

# getStressVal
source: Get Stress Value
zh_hans: 获取压力值

# getSupportMaxSetItemsNum
source: Get maximum number of settings supported by firmware event number
zh_hans: 获取固件支持的最大设置项数量

# getUnerasableMeunList
source: Get non-deletable menu list in firmware event number
zh_hans: 获取固件中不可删除的菜单列表

# getUnit
source: Get Unit event number
zh_hans: 获取单位

# getUnreadAppReminder
source: Get unread app reminder switch event number
zh_hans: 获取红点提醒开关

# getUpdateStatus
source: Get device update status event number
zh_hans: 获取设备更新状态

# getUpHandGesture
source: Get wrist up gesture data event number
zh_hans: 获取抬腕手势数据

# getWalkRemind
source: Get walk reminder event number
zh_hans: 获取步行提醒

source: Get Watch Dial ID
zh_hans: 获取表盘ID

# getWatchDialInfo
source: Get Screen Information
zh_hans: 获取屏幕信息

# getWatchListV2
source: Getting watch face list for V2
zh_hans: 获取表盘列表

# getWatchListV3
source: Getting watch face list for V3 (New)
zh_hans: 获取表盘列表v3

source: golf
zh_hans: 高尔夫

# gps_tips
source: If the mobile phone location permission is not authorized, the watch will not be able to quickly locate the phone.
zh_hans: 未授权手机定位权限，将无法加速手表快速定位

source: Grade
zh_hans: 坡度

source: gym
zh_hans: 健身房

source: gymnastics
zh_hans: 体操

source: handball
zh_hans: 手球

source: Heart Rate
zh_hans: 心率

source: Heart Rate Reserve
zh_hans: 心率储备

source: Heart Rate Zone
zh_hans: 心率区间

source: heartRate
zh_hans: 心率类

source: high knees
zh_hans: 高抬腿

source: high-intensity interval training
zh_hans: 高强度间歇训练法

source: hike
zh_hans: 徒步

source: hip-hop
zh_hans: 街舞

source: hockey
zh_hans: 曲棍球

source: horizontal bar
zh_hans: 单杠

source: horseback riding
zh_hans: 骑马

source: ice hockey
zh_hans: 冰球

source: indoor cycling
zh_hans: 室内骑行

source: indoor rowing
zh_hans: 室内划船

source: indoor running
zh_hans: 室内跑步

source: indoor walking
zh_hans: 室内走路

source: jumping jacks
zh_hans: 开合跳

source: karate
zh_hans: 空手道

source: kayak
zh_hans: 皮艇

source: kickboxing
zh_hans: 自由搏击

source: kite flying
zh_hans: 放风筝

source: Lap Ascent
zh_hans: 圈上升高度

source: Lap Cadence
zh_hans: 圈步频

source: Lap Descent
zh_hans: 圈下降高度

source: Lap Effort Pace
zh_hans: 圈实时配速

source: Lap Heart Rate
zh_hans: 圈心率

source: Lap Pace
zh_hans: 圈配速

source: Lap Power
zh_hans: 圈功率

source: Lap Speed
zh_hans: 圈速度

source: Lap Strido Length
zh_hans: 圈步幅

source: Lap Time
zh_hans: 圈时间

source: Lap Vertical Speed
zh_hans: 圈垂直速度

source: Last Lap Ascent
zh_hans: 上一圈上升高度

source: Last Lap Cadence
zh_hans: 上一圈步频

source: Last Lap Descent
zh_hans: 上一圈下降高度

source: Last Lap Distance
zh_hans: 上一圈距离

source: Last Lap Heart Rate
zh_hans: 上一圈心率

source: Last Lap Pace
zh_hans: 上一圈配速

source: Last Lap Speed
zh_hans: 上一圈速度

source: Last Lap Time
zh_hans: 上一圈时间

source: Main switch
zh_hans: 总开关

source: martial arts
zh_hans: 武术

source: Max Heart Rate
zh_hans: 最大心率

source: Maximum Speed
zh_hans: 最大速度

source: motorboat
zh_hans: 摩托艇

source: mountain climbing
zh_hans: 爬山

# musicControl
source: Music control event number
zh_hans: 音乐控制事件编号

# need_ignore_pair
source: Pairing is abnormal, you need to manually ignore the device (Settings-Bluetooth-Find Device-"!")-Ignore this device
zh_hans: 配对异常，需要手动忽略设备（设置-蓝牙-找到设备-"!")-忽略此设备

# nonsupport
source: This device does not support
zh_hans: 该设备不支持

# noticeMessageV3
source: Notification message reminder event number
zh_hans: 通知消息提醒事件编号

# notify_allowed
source: allowed
zh_hans: 允许通知

# notify_disabled
source: disabled
zh_hans: 关闭通知

source: Notify settings
zh_hans: 通知设置

# notify_silent
source: silent
zh_hans: 静默通知

source: On fast config...
zh_hans: 快速配置中...

source: open water swimming
zh_hans: 开放水域游泳

source: organize and relax
zh_hans: 整理放松

source: other
zh_hans: 其他类

source: other activity
zh_hans: 其他运动

source: outdoor cycling
zh_hans: 户外骑行

source: outdoor Fun
zh_hans: 户外玩耍

source: outdoor running
zh_hans: 户外跑步

source: outdoor walking
zh_hans: 户外走路

source: Overall Response Time
zh_hans: 整体响应时间

source: overall ResponseTime
zh_hans: 总响应时间

source: pace
zh_hans: 配速类

source: Pace
zh_hans: 配速

source: parallel bar
zh_hans: 双杠

source: parkour
zh_hans: 跑酷

# photoStart
source: Start taking photos (app -> ble)
zh_hans: 开始拍照 (app -> ble)

# photoStop
source: Stop taking photos (app -> ble)
zh_hans: 结束拍照 (app -> ble)

source: pilates
zh_hans: 普拉提

source: plank
zh_hans: 平板支撑

source: pool swimming
zh_hans: 泳池游泳

source: power
zh_hans: 功率类

source: Power
zh_hans: 功率

source: power30sAveragePower
zh_hans: 30秒平均功率

source: pull ups
zh_hans: 引体向上

source: push-ups
zh_hans: 俯卧撑

source: rafting
zh_hans: 漂流

# reboot
source: Reboot device
zh_hans: 重启设备

source: Refresh
zh_hans: 刷新

# requestAlgFile
source: Request firmware algorithm file information (ACC/GPS)
zh_hans: 请求固件算法文件信息（ACC/GPS）

source: ride
zh_hans: 骑行

source: rock climbing
zh_hans: 攀岩

source: roller skating
zh_hans: 轮滑

source: rope skipping
zh_hans: 跳绳

source: rowing
zh_hans: 赛艇

source: rowing machine
zh_hans: 划船机

source: rugby
zh_hans: 橄榄球

source: run
zh_hans: 跑步

source: running Economy
zh_hans: 跑步类

source: running Fitness
zh_hans: 跑步健身类

source: sailing
zh_hans: 帆船

source: sepak takraw
zh_hans: 藤球

# setAlarm
source: Getting Alarms for V3APP Devices
zh_hans: 获取 V3APP 设备的闹钟

# setAlgorithmRawDataSensorConfig
source: Set Algorithm Sensor Config
zh_hans: 设置算法原始数据传感器配置

source: Set App Base Info
zh_hans: 设置应用基础信息

# setAppletControl
source: Operation of applet information (obtain, start, delete)
zh_hans: 操作小程序信息（获取、启动、删除）

source: Set Bike Lock List
zh_hans: 设置单车锁列表

# setBleVoice
source: Set phone volume for device event number
zh_hans: 设置设备手机音量事件编号

# setBloodGlucoseDataV01
source: Send Blood Glucose Data V01
zh_hans: 下发血糖数据V01

# setBodyPowerTurn
source: Set body power switch event number
zh_hans: 设置身体能量开关事件编号

# setBpCalControlV3
source: Blood Pressure Calibration Control
zh_hans: 血压校准控制

source: Set Call Quick Reply On/Off
zh_hans: 设置来电快捷回复开关

# setCalorieDistanceGoal
source: Set calorie and distance goal (Set daily three rings)
zh_hans: 设置卡路里和距离目标（设置日常三环）

# setDateTime
source: Set Time
zh_hans: 设置时间

# setDefaultMsgList
source: Set the default messaging app list
zh_hans: 设置默认消息应用列表

# setDisplayMode
source: Display mode event number
zh_hans: 显示模式事件编号

# setDrinkWaterRemind
source: Set Drink Water Reminder
zh_hans: 设置喝水提醒

# setDuringExercise
source: Set During Exercise Reminder
zh_hans: 设置运动中提示音开关

source: Set Find Phone
zh_hans: 设置查找手机

# setFitnessGuidance
source: Fitness Guidance Event
zh_hans: 健身指导事件

# setHand
source: Set left or right hand
zh_hans: 设置左右手

# setHeartMode
source: Set heart rate mode
zh_hans: 设置心率模式

source: Set heart rate interval
zh_hans: 设置心率区间

# setHistoricalMenstruation
source: Menstrual historical data delivery event number
zh_hans: 月经历史数据下发事件编号

# setHotStartParam
source: Set hot start parameters
zh_hans: 设置热启动参数

# setLongCityNameV3
source: V3 Setting the Name of a Sports City event number
zh_hans: V3 设置运动城市名称事件编号

# setLostFind
source: Set Lost Find Event
zh_hans: 设置丢失查找事件

source: Set menstruation
zh_hans: 设置经期

# setMenstruationRemind
source: Set Menstruation Reminder
zh_hans: 设置经期提醒

source: Set Menu List
zh_hans: 设置菜单列表

source: Set Menu List V3
zh_hans: 设置菜单列表V3

# setMusicOnOff
source: Set Music On/Off Event
zh_hans: 设置音乐开关事件

# setNotDisturb
source: Set Do Not Disturb
zh_hans: 设置勿扰模式

# setNoticeAppName
source: V3 dynamic notification message event number
zh_hans: V3 动态通知消息事件编号

# setNoticeMessageState
source: Setting Notification Status for a Single App
zh_hans: 设置单个应用的通知状态

# setNoticeStatusAllOff
source: Set Notification Center Event (Fully closed)
zh_hans: 设置通知中心事件（全部关闭）

# setNoticeStatusAllOn
source: Set Notification Center Event (Fully open)
zh_hans: 设置通知中心事件（全部开启）

# setNoticeStatusBtPair
source: Set Notification Center Event (Bt pair)
zh_hans: 设置通知中心事件（Bt配对）

# setNotificationStatus
source: Notification app status setting event
zh_hans: 通知应用状态设置事件

# setOnekeySOS
source: Set the one-touch calling event number
zh_hans: 设置一键呼叫事件编号

# setOverFindPhone
source: Stop Find Phone
zh_hans: 停止查找手机

# setRRespiRateTurn
source: Respiration rate switch setting event
zh_hans: 设置呼吸率开关事件

# setSchedulerReminder
source: Schedule Reminder
zh_hans: 日程提醒

# setScientificSleepSwitch
source: Scientific sleep switch setting event
zh_hans: 科学睡眠开关设置事件

source: Set screen brightness
zh_hans: 设置屏幕亮度

# setSendRunPlan
source: App issued running plan (exercise plan) event number
zh_hans: App 下发跑步计划（运动计划）事件编号

source: Set shortcut
zh_hans: 设置快捷方式

source: Set Simple Heart Rate Zone
zh_hans: 设置简单心率区间

# setSleepPeriod
source: Set sleep period event
zh_hans: 设置睡眠周期事件

# setSpo2Switch
source: Set SpO2 switch event
zh_hans: 设置血氧开关事件

# setSport100Sort
source: Set and Query 100 Sports Sorting
zh_hans: 设置和查询 100 种运动排序

# setSportGoal
source: Set exercise goal event
zh_hans: 设置运动目标事件

source: Set Sporting Remind Setting
zh_hans: 设置运动中提醒

# setSportModeSelect
source: Set sport mode select event number
zh_hans: 设置运动模式选择事件编号

# setSportModeSort
source: Set Sport Mode Sorting
zh_hans: 设置运动模式排序

# setSportScreen
source: Set Sport Screen Items
zh_hans: 设置运动屏幕项

# setSportsTypeV3
source: Modify the sports list (sort/delete/add)
zh_hans: 修改运动列表（排序/删除/添加）

source: Set stress switch
zh_hans: 设置压力开关

# setSyncContact
source: Synchronization Protocol Bluetooth Call Common Contacts
zh_hans: 同步协议蓝牙通话常用联系人

# setTemperatureSwitch
source: Set Night-time Temperature Switch Event Code
zh_hans: 设置夜间温度开关事件编号

# setUnit
source: Set Unit event number
zh_hans: 设置单位事件编号

# setUnreadAppReminder
source: Unread message reminder switch event number
zh_hans: 未读消息提醒开关事件编号

# setUpHandGesture
source: Raise-to-wake gesture event number
zh_hans: 设置抬腕手势事件编号

# setUserInfo
source: Set user information
zh_hans: 设置用户信息

# setV3Noise
source: Set Environmental Noise Volume On/Off and Threshold Event
zh_hans: 设置环境噪音开关及阈值事件

source: Set Voice Assistant On/Off
zh_hans: 设置语音助手开关

# setWalkRemind
source: Set walk reminder
zh_hans: 设置走动提醒

# setWatchDial
source: Set watch face event number
zh_hans: 设置表盘事件编号

# setWatchDialSort
source: Set watch dial sort event
zh_hans: 设置表盘排序事件

# setWatchFaceData
source: Set Watch Face
zh_hans: 设置表盘

# setWeatherCityName
source: Set weather city name event number
zh_hans: 设置天气城市名称事件编号

# setWeatherSunTime
source: Set sunrise and sunset time event number
zh_hans: 设置日出和日落时间事件编号

# setWeatherSwitch
source: Set weather switch event number
zh_hans: 设置天气开关事件编号

# setWeatherV3
source: Send the v3 weather protocol event number under v3
zh_hans: 发送 V3 天气协议事件编号

# setWorldTimeV3
source: v3 set v3 world time
zh_hans: V3 设置世界时间

source: shuttlecock
zh_hans: 毽球

source: sit-ups
zh_hans: 仰卧起坐

source: skateboarding
zh_hans: 滑板

source: skiing
zh_hans: 滑雪

source: sled
zh_hans: 雪橇

source: snow sports
zh_hans: 雪上运动

source: snowboard
zh_hans: 单板滑雪

source: snowmobile
zh_hans: 雪车

source: social dance
zh_hans: 社交舞

source: softball
zh_hans: 垒球

source: speed
zh_hans: 速度类

source: Speed
zh_hans: 速度

source: spinning
zh_hans: 动感单车

source: square dance
zh_hans: 广场舞

source: squash
zh_hans: 壁球

source: squats
zh_hans: 深蹲

source: stair climbing
zh_hans: 爬楼

source: Stride Length
zh_hans: 步幅

source: Supported
zh_hans: 支持

source: surfing
zh_hans: 冲浪

source: swim
zh_hans: 游泳

# system_notify_tips
source: Note: For iOS 13 and above, you need to turn on [Share System Notifications] in the phone system.
zh_hans: 注：iOS13以上版本，需要打开手机系统中的[共享系统通知]

source: table tennis
zh_hans: 乒乓球

source: taekwondo
zh_hans: 跆拳道

source: tai chi
zh_hans: 太极

source: tennis
zh_hans: 网球

source: time
zh_hans: 时间类

source: Time To Sunrise Sunset
zh_hans: 距离日出/日落时间

source: Total Ascent
zh_hans: 总上升高度

source: Total Descent
zh_hans: 总下降高度

source: Total Distance
zh_hans: 总距离

source: Total Time
zh_hans: 总时间

source: Track and field
zh_hans: 田径

source: traditional strength training
zh_hans: 传统力量训练

source: Training Load
zh_hans: 训练负荷

source: treadmill
zh_hans: 跑步机

source: treadmills
zh_hans: 踏步机

source: Unsupported
zh_hans: 不支持

source: Vertical Speed
zh_hans: 垂直速度

source: Vo2max
zh_hans: 最大摄氧量

source: volleyball
zh_hans: 排球

source: walk
zh_hans: 走路

source: walking machine
zh_hans: 漫步机

source: water polo
zh_hans: 水球

source: weight lifting
zh_hans: 举重

source: windsurfing
zh_hans: 帆板

source: yoga
zh_hans: 瑜伽

source: zumba
zh_hans: 尊巴舞

# 导入ZIP文件
source: Import ZIP file
zh_hans: 导入ZIP文件

# 确定
source: Confrim
zh_hans: 确定

# 表盘定制工具
source: Dial Customization Tool
zh_hans: 表盘定制工具
